tutorials/RAS/suspensionDev/1Dflow/0_org/finite-area/qb
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       areaVectorField;
    location    "0";
    object      qb;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletFa
    {
        type            zeroGradient;
    }
    outletFa
    {
        type            zeroGradient;
    }
    sidesFa
    {
        type            empty;
    }
}


// ************************************************************************* //
